{
  "version": "https://jsonfeed.org/version/1",
  "title": "Espadrine’s blog",
  "description": "Let’s talk about whatever I learn!",
  "home_page_url": "https://espadrine.github.io/blog/",
  "feed_url": "https://espadrine.github.io/blog/feed.json",
  "author": {
    "name": "Thaddée Tyl",
    "url": "https://github.com/espadrine"
  },
  "favicon": "https://avatars.githubusercontent.com/u/100689?s=64",
  "items": [
      {
        "id":  "https://espadrine.github.io/blog/posts/thefiletree-design-log-4.html",
        "url": "https://espadrine.github.io/blog/posts/thefiletree-design-log-4.html",
        "title": "TheFileTree Design Log 4: Accounts",
        "tags": "tree",
        "date_published": "2018-03-01T23:19:58Z"
        "content_html": "<h1>TheFileTree Design Log 4: Accounts</h1>\n<p>I mentionned needing to add accounts in <a href=\"./thefiletree-design-log-2.html\">design log 2</a>. It is <a href=\"https://github.com/garden/tree/commit/04a03786d81733aeca35b1ac4fe5b95c57d0e706\">now implemented</a>.</p>\n<p>You go to <code>/app/account/</code>, which contains either your account information if you are logged in, or a form to get registered.</p>\n<p><img src=\"https://i.imgur.com/rlfES3K.png\" alt=\"Create an Account\" /></p>\n<p><img src=\"https://i.imgur.com/5oZdUdH.png\" alt=\"Congratulations for signing up\" /></p>\n<p>You get an email with a link back to the website, which gives you a httpOnly secure cookie with a token that the database will recognize and associate to a JSON blob containing your information (email, user name).</p>\n<p><img src=\"https://i.imgur.com/mWxce40.png\" alt=\"Email with link\" /></p>\n<p><img src=\"https://i.imgur.com/bNBGooa.png\" alt=\"Welcome page\" /></p>\n<p><img src=\"https://i.imgur.com/Pw4thNV.png\" alt=\"Account page\" /></p>\n<p>As planned, I use email-login, which I improved for this purpose by adding support for <a href=\"https://www.cockroachlabs.com/\">CockroachDB</a>, a serializable distributed SQL database that I plan on using more (maybe for file metadata).</p>\n<p>All files <a href=\"https://github.com/garden/tree/commit/6fbe24c41dfa7085533a6a0157daefc5a28ed7a4\">now</a> have an Access Control List (ACL) so that you can set the default access (none (404), reader, writer (can see and edit), owner (can also change the metadata, and therefore the ACL).</p>\n<p><img src=\"https://i.imgur.com/2lROKuf.png\" alt=\"Folder ownership\" /></p>\n<p>ACLs on folders apply to all subfiles unless an explicit ACL overrides it. It works like variable scoping: the nearest containing metafolder with an explicit ACL that applies to you determines your access.</p>\n<p>It works by setting the <code>acl</code> JSON object in the metadata. It is a map from username to right: <code>-</code> for none, <code>r</code> for reader, <code>w</code> for writer, <code>x</code> for owner.  Does it remind you of Unix permissions?</p>\n<p><img src=\"https://i.imgur.com/c04V9J9.png\" alt=\"JSON metadata\" /></p>\n<p>The <code>*</code> key is for other users (logged in or anonymous).</p>\n<h2>Canop Finishing Touches</h2>\n<p>Code and bugs are lovers. The monster that I am had to crush a handful of the latter, but it really was to save the former.</p>\n<p>For instance, <strong>undo/redo</strong> was semantically wrong.</p>\n<p>Why? Of course, CodeMirror supports undo/redo, but it keeps track of all changes. However, when you are editing code with others, you only want to undo <em>your own changes</em>. If you wrote a word and press <em>Undo</em>, you expect your word to be removed, not the operations that someone else did in the meantime.</p>\n<p>That required <a href=\"https://github.com/espadrine/canop/commit/ed07dc80f8da61da15dee0703893315b1f863ba6\">managing my own undo stack</a></p>\n<p>Another tricky situation arose while testing when I started using <strong>multiple cursors</strong>, a feature that every text editor under the sun stole from <a href=\"https://www.sublimetext.com/docs/2/multiple_selection_with_the_keyboard.html\">SublimeText</a> (although Wikipedia <a href=\"https://en.wikipedia.org/wiki/Simultaneous_editing\">mentions</a> MIT’s <a href=\"https://en.wikipedia.org/wiki/Simultaneous_editing\">LAPIS</a> as the first to sport it, as part of their academic paper.)</p>\n<p>I received the editing operations CodeMirror gave me from the <code>change</code> events after it had already updated the editor. The operation positions I dealt with could not easily be mapped back to indices, as they related to the editor’s state before the change.</p>\n<p>I tried getting inspiration from <a href=\"https://github.com/Operational-Transformation/ot.js/blob/8873b7e28e83f9adbf6c3a28ec639c9151a838ae/lib/codemirror-adapter.js#L55\">ot.js</a>, but ended up relying on a <a href=\"https://github.com/espadrine/canop/commit/1bc109bfc6b075b1a59d4e2401f902edfdf8288a\">simpler algorithm using the <code>beforeChange</code> event</a>.</p>\n<p>It does have the downside that you don’t automatically have multiple changes that are semantically combined (like deleting multiple selections). Those end up having a single undo entry, for instance. I was getting used to reimplementing CodeMirror things, so naturally I implemented a <a href=\"https://github.com/espadrine/canop/commit/7beec5d1b8e231e0a52c6402931d5db77c2491da\">time-based operation grouping system</a>.</p>\n<h2>Deploying To Production</h2>\n<p>The first version of TheFileTree was located on a server under our college\ndormroom desks; the second in a college server; the third on a friend’s\nsubletting server offer; the fourth on an OVH VPS. This one will be on Google\nCloud, starting with their free tier, where it should fit for some time before\nit, hopefully starts generating revenue to be self-sustaining.</p>\n<p>It did require some subtle tweaking to support the fact that sending emails is\nseverely restricted on Google Cloud. There is a handful of partners that you\nhave to go through; I picked MailJet. I tweaked the <code>email-login</code> npm package\nand my DNS zone file to make it work.</p>\n<p>As far as administrator interfaces are concerned, Google Cloud is extremely\npolished, offering a clean interface with good configuration, and even a\nconvenient remote SSH-in-a-tab.</p>\n<p>While it is still slightly slower to get up and running with a fresh instance\nthan on Digital Ocean, it is a step up from OVH. That said, OVH offers a\npredictable fixed cost and no egress cost, while GCP will have complicated costs\nto manage once I need to look after them.</p>\n<p>Sadly, to get on the free tier, I was required to host the servers in South\nCarolina, US. There is a subtle bit more latency as a result from France.</p>\n<p>All in all, it was a very interesting choice to have. The website is now much\nmore robust than it was before. The only dark spot is the single-node\nCockroachDB server, which dies on a regular basis, seemingly because it does not\nlike to be alone. I will have to investigate further later.</p>\n<script type=\"application/ld+json\">\n{ \"@context\": \"http://schema.org\",\n  \"@type\": \"BlogPosting\",\n  \"datePublished\": \"2018-03-01T23:19:58Z\",\n  \"keywords\": \"tree\" }\n</script>\n",
      },
      {
        "id":  "https://espadrine.github.io/blog/posts/what-i-made-in-2016.html",
        "url": "https://espadrine.github.io/blog/posts/what-i-made-in-2016.html",
        "title": "What I Made In 2016",
        "tags": "retro",
        "date_published": "2017-06-16T20:12:00Z"
        "content_html": "<h1>What I Made In 2016</h1>\n<p>This year, the company I work for, Captain Train, was purchased by its English counterpart, Trainline. I added support for American Express BTA lodged cards, upgraded the SNCF integration to support their new fare systems, and worked on the common format for carriers.</p>\n<p>In open-source, I made the following.</p>\n<ul>\n<li>A natural-language-processing bot library <a href=\"https://github.com/espadrine/queread\">queread</a>, in order to power <a href=\"https://github.com/espadrine/travelbot\">travelbot</a>, a CLI and Slack bot system which you can ask for travel information across Europe. It uses <a href=\"https://github.com/espadrine/travel-scrapper\">travel-scrapper</a>, which relies on the Trainline websites for data.</li>\n<li>A multiplayer musical editor on top of TheFileTree, as a flexible textual editor. See <a href=\"https://thefiletree.com/david/audio/test.abc\">this example</a>.</li>\n<li><a href=\"https://github.com/espadrine/email-login\">Email-Login</a> is now robust and ready to use.</li>\n<li><a href=\"https://espadrine.github.io/spash/\">Spash</a>, a <a href=\"https://en.wikipedia.org/wiki/Geohash\">geohash</a>-inspired Spacetime locator.</li>\n<li>The <a href=\"https://github.com/espadrine/json-diff\">json-diff</a> gem offers a brand-new algorithm for diffing JSON content, with support for in-array object move operations as a first-class citizen, unlike existing LCS-based approaches, resulting in better output. I even published a <a href=\"https://engineering.thetrainline.com/2016/10/05/how-we-switched-without-a-hitch-to-a-new-api/\">blog post</a> on Trainline’s blog.</li>\n<li>The <a href=\"https://github.com/espadrine/json-api-vanilla\">json-api-vanilla</a> gem parses <a href=\"http://jsonapi.org/\">JSONAPI</a> payloads (ie. JSON with references, to support object graphs with reference cycles, etc.) and converts it to vanilla Ruby objects, with references correctly hooked up, without <em>any class definition needed</em>, unlike what existed before that.</li>\n<li>The <a href=\"https://github.com/espadrine/canop/blob/master/doc/protocol.md\">Canop protocol</a> was finalized and implemented. <a href=\"https://github.com/espadrine/canop/commit/b0f37b2cc789513e9c8bd1986e113bed6580328f\">This commit</a> in particular finally implemented proper index shifting for intention preservation, so that people can edit the same text file simultaneously without losing their changes.</li>\n<li>The <a href=\"https://github.com/espadrine/json-sync\">json-sync</a> project sprung out of the Canop effort. Unlike Canop, it cannot yet perform intention preservation. However, its design supports peer-to-peer networks, unlike Canop which is centralized.</li>\n</ul>\n<p>I took greater concern in explaining my projects. People wouldn’t understand the schematics for the first automobile, but a simple demonstration is enough to blow everybody’s mind.</p>\n<p><a href=\"http://espadrine.tumblr.com/post/138229350686/what-i-did-in-2015\">Previously</a>.</p>\n<script type=\"application/ld+json\">\n{ \"@context\": \"http://schema.org\",\n  \"@type\": \"BlogPosting\",\n  \"datePublished\": \"2017-06-16T20:12:00Z\",\n  \"keywords\": \"retro\" }\n</script>\n",
      },
      {
        "id":  "https://espadrine.github.io/blog/posts/a-go-browser-battle.html",
        "url": "https://espadrine.github.io/blog/posts/a-go-browser-battle.html",
        "title": "A Go Browser Battle",
        "tags": "baduk ai",
        "date_published": "2017-06-16T16:53:49Z"
        "content_html": "<h1>A Go Browser Battle</h1>\n<p>I learned Go from my Dad — after all, we lived in Japan for a short while when I was little — but DeepMind’s <a href=\"https://events.google.com/alphago2017/\">foray</a> into the venerable board game definitely renewed my interest.</p>\n<p>My friend <a href=\"https://github.com/jankeromnes/\">Jan</a>, also intrigued, had started working on a browser-based interface to play the game.</p>\n<p>So I offered him a playful challenge: we would both try to build an interesting AI for the game, and we would pit them against each other.\nEach AI would be in a separate <a href=\"https://html.spec.whatwg.org/multipage/workers.html#workers\">WebWorker</a>.\nAt each turn, they would receive the board state.\nThey would have one minute to come up with their move, in a best-of-five tournament.</p>\n<p>From what he told me, Jan will be trying to brute-force the search tree with a traditional minimax.\nHe is betting on a smart and fast board evaluation.</p>\n<p>As for me, I started studying the <a href=\"https://storage.googleapis.com/deepmind-media/alphago/AlphaGoNaturePaper.pdf\">AlphaGo Nature paper</a>.\nI took machine learning classes at University; time to apply what I learned!</p>\n<p>I definitely don’t have the computing power or the time to reach the level that AlphaGo achieved.\nIt took months of training and self-play on tens of GPUs and hundreds of CPUs.\nMy dream is to reach 1d; a rank roughly equivalent to a black belt in martial arts.</p>\n<h2>Stepping Stones</h2>\n<p>Go games are typically saved as <a href=\"http://www.red-bean.com/sgf/\">SGF</a> files, which are plentiful on the Web.\nTherefore, the first step I needed to achieve was to have an SGF parser and a Go execution engine.\nThe engine is designed to give me a wealth of information about the game: what group is a stone part of, how many liberties that group has…</p>\n<p><img src=\"https://thefiletree.com/metaboard/go/blog/intro/print-sgf.png\" alt=\"SGF printer output\" /></p>\n<p>I downloaded all KGS games involving players that are 4d or above.\nI hope my design achieves 1d, so in principle, the AI will never reach that level of play.</p>\n<p>Aside: I think it is interesting to think about learning in terms of <em>training capacity</em> and <em>model capacity</em>.\nHere, since we learn to mimick the moves of the training set, the AI can only be as smart as the training set, which puts a limit to how intelligent it can be.\nBut the model itself can achieve a superior level through self-play (which is what DeepMind did, obviously, since they reached a level beyond the top human player). Then, the level they can achieve is that of the model capacity.\nAn entity able to perfectly analyse all possible futures would have the highest possible model capacity.</p>\n<p>The KGS dataset represents 1.7 million games.\nAfter rotating and reflecting each game, I should reach 13.5 million games, which should be enough to teach the neural network.</p>\n<p><img src=\"https://thefiletree.com/metaboard/go/blog/intro/badukjs.png\" alt=\"6.5 GB of downloaded KGS SGF files\" /></p>\n<p>Just like AlphaGo, I will first train a <strong>move guesser</strong> using a convolutional neural network.\nThat network reads the board through a hundred lenses called “filters” that focus on 3x3 squares (or 5x5 on the first layer).\nEach lens annotates every intersection with an analysis of its surroundings.\nThe annotated board is given as input to a different set of lenses, and so on, ten times.\nThe last annotated board rates the moves with how likely KGS players are to make them.</p>\n<p>The move guesser can be used standalone, although I don’t expect it to perform well.\nIts main purpose is to limit the number of moves you will look at on the search tree.\nExpanding too many nodes can really make your AI lose precious time.</p>\n<p>I also want to train a <strong>win guesser</strong>. It is another convolutional neural network.\nInstead of yielding likely moves, it will tell you who it thinks will win.</p>\n<p>While AlphaGo trained its win guesser from self-play games which also improved its move guesser, I am unsure whether I will have enough time to implement self-play tournaments.\nBut having a win guesser learn from the KGS data set is possible; it simply might yield poor results.</p>\n<p>Finally, if I have time to spare, I may implement <strong>Monte-Carlo Tree Search</strong> (<a href=\"https://en.wikipedia.org/wiki/Monte-Carlo_Tree_Search\">MCTS</a>).\nIt requires having a very fast move guesser (not the 10-layer monster).\nAlphaGo trained a shallower neural network for that purpose, feeding it, in addition to the board state, whether a given move matches a set of well-known patterns.\nThe paper claims it guesses about 24% of moves from their data set, at a meager 2 μs.</p>\n<p>For this purpose, I am tempted to perform some custom statistical analysis on the training data.\nYet again, it depends on what that yields, and how much time I have.</p>\n<p>MCTS works by repeating the following steps:</p>\n<ol>\n<li>walk the tree through what is currently the best move,</li>\n<li>without adding nodes to the search tree, play with the weak move guesser until the end of the game,</li>\n<li>update the node’s ancestors in the search tree to count the number of wins and losses, which may change what is the best move.</li>\n</ol>\n<p>When a node is walked through enough times, it gets expanded with the strong move guesser.</p>\n<h2>Into The Browser</h2>\n<p>I plan on training the networks in Python with <a href=\"https://keras.io/\">Keras</a>, which will use <a href=\"https://www.tensorflow.org\">TensorFlow</a> to benefit from its optimized C++ engine.\nI own a desktop computer that unfortunately features a weak-ish Nvidia GPU, but it will have to do!</p>\n<p>Keras is fast becoming the standard API to train and export neural nets; Microsoft recently touted its support as a front-end for <a href=\"https://www.microsoft.com/en-us/cognitive-toolkit/\">CNTK</a> when they unveiled <a href=\"https://docs.microsoft.com/en-us/cognitive-toolkit/ReleaseNotes/CNTK_2_0_Release_Notes\">version 2</a> of the library.\nInevitably, there are a couple libraries to convert Keras models to JavaScript.\n<a href=\"https://github.com/transcranial/keras-js\">Keras.js</a> most notably features GPU support, but using the GPU in a <a href=\"https://html.spec.whatwg.org/multipage/workers.html#workers\">WebWorker</a> is not yet possible.\nMaybe when all browsers implement <a href=\"https://html.spec.whatwg.org/multipage/scripting.html#the-offscreencanvas-interface\">OffscreenCanvas</a> and Keras.js <a href=\"https://github.com/transcranial/keras-js/issues/3\">implements support for it</a>?</p>\n<p>And there’s <a href=\"https://mil-tokyo.github.io/webdnn/\">WebDNN</a>, which I will use.</p>\n<p>WebDNN is fastest when using <a href=\"https://webkit.org/blog/7504/webgpu-prototype-and-demos/\">WebGPU</a>, a standard that I hope will get traction, but that is currently Safari-only.\nHowever, it can compile the neural network to <a href=\"http://webassembly.org/\">WebAssembly</a>, which should fit in a <a href=\"https://html.spec.whatwg.org/multipage/workers.html#workers\">WebWorker</a>.</p>\n<h2>Dreams and Work</h2>\n<p>This will all be a free-time effort.\nThere is no planned date for the final confrontation.</p>\n<p>The code for the SGF parser, Go engine, and AIs will be <a href=\"https://github.com/espadrine/badukjs\">here</a>, and the UI code will be <a href=\"https://github.com/jankeromnes/metaboard\">there</a>.</p>\n<script type=\"application/ld+json\">\n{ \"@context\": \"http://schema.org\",\n  \"@type\": \"BlogPosting\",\n  \"datePublished\": \"2017-06-16T16:53:49Z\",\n  \"keywords\": \"baduk, ai\" }\n</script>\n",
      }
  ]
}
